<a href="https://colab.research.google.com/github/VardaanThapa/Data_Science_code/blob/main/python_practise_210827.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [4]:
import pandas as pd,numpy as np
import matplotlib as mpl
import seaborn as sns

In [82]:
df = pd.read_csv("sample_data/california_housing_test.csv")

In [11]:
df.head(10)

      longitude  latitude  ...  median_income  median_house_value
2990    -118.23     34.09  ...         2.6923            150000.0
2991    -117.17     34.28  ...         7.1997            253800.0
2992    -122.33     37.39  ...         6.2263            500001.0
2993    -117.91     33.60  ...         5.1048            500001.0
2994    -117.93     33.86  ...         5.5867            182500.0
2995    -119.86     34.42  ...         1.1790            225000.0
2996    -118.14     34.06  ...         3.3906            237200.0
2997    -119.70     36.30  ...         2.2895             62000.0
2998    -117.12     34.10  ...         3.2708            162500.0
2999    -119.63     34.42  ...         8.5608            500001.0

[10 rows x 9 columns]

In [14]:
df.columns

Index(['longitude', 'latitude', 'housing_median_age', 'total_rooms',
       'total_bedrooms', 'population', 'households', 'median_income',
       'median_house_value'],
      dtype='object')

In [24]:
df.iloc[:5,[1]]

   latitude
0     37.37
1     34.26
2     33.78
3     33.82
4     36.33

In [34]:
df.iloc[:,1].dtype

dtype('float64')

In [39]:
df.describe()

         longitude    latitude  ...  median_income  median_house_value
count  3000.000000  3000.00000  ...    3000.000000          3000.00000
mean   -119.589200    35.63539  ...       3.807272        205846.27500
std       1.994936     2.12967  ...       1.854512        113119.68747
min    -124.180000    32.56000  ...       0.499900         22500.00000
25%    -121.810000    33.93000  ...       2.544000        121200.00000
50%    -118.485000    34.27000  ...       3.487150        177650.00000
75%    -118.020000    37.69000  ...       4.656475        263975.00000
max    -114.490000    41.92000  ...      15.000100        500001.00000

[8 rows x 9 columns]

In [45]:
df.iloc[:,[1]].max()

latitude    41.92
dtype: float64

In [47]:
df.max()

longitude               -114.4900
latitude                  41.9200
housing_median_age        52.0000
total_rooms            30450.0000
total_bedrooms          5419.0000
population             11935.0000
households              4930.0000
median_income             15.0001
median_house_value    500001.0000
dtype: float64

In [48]:
df.mean()

longitude               -119.589200
latitude                  35.635390
housing_median_age        28.845333
total_rooms             2599.578667
total_bedrooms           529.950667
population              1402.798667
households               489.912000
median_income              3.807272
median_house_value    205846.275000
dtype: float64

In [53]:
df.total_rooms.value_counts()

1778.0     5
1966.0     5
907.0      5
1787.0     5
2127.0     4
          ..
4337.0     1
13802.0    1
16590.0    1
3835.0     1
67.0       1
Name: total_rooms, Length: 2215, dtype: int64

In [54]:
df.std()

longitude                  1.994936
latitude                   2.129670
housing_median_age        12.555396
total_rooms             2155.593332
total_bedrooms           415.654368
population              1030.543012
households               365.422710
median_income              1.854512
median_house_value    113119.687470
dtype: float64

In [55]:
df[:50].mean()

longitude               -119.377200
latitude                  35.400200
housing_median_age        29.300000
total_rooms             2793.100000
total_bedrooms           556.200000
population              1525.440000
households               528.080000
median_income              4.024894
median_house_value    205638.020000
dtype: float64

In [56]:
df.head(50).mean()

longitude               -119.377200
latitude                  35.400200
housing_median_age        29.300000
total_rooms             2793.100000
total_bedrooms           556.200000
population              1525.440000
households               528.080000
median_income              4.024894
median_house_value    205638.020000
dtype: float64

In [68]:
df["rank"] = df.population.rank(axis=0,ascending=True)

In [73]:
df[["population","rank"]]

      population    rank
0         1537.0  2025.0
1          809.0   812.5
2         1484.0  1958.0
3           49.0    26.0
4          850.0   889.0
...          ...     ...
2995      1258.0  1652.0
2996      3496.0  2877.0
2997       693.0   579.0
2998        46.0    24.0
2999       753.0   690.5

[3000 rows x 2 columns]

In [77]:
df.population.mean()

1402.7986666666666

In [85]:
df =  pd.read_csv("Computer_Data.csv")

In [101]:
df_g = df.groupby("screen")

In [99]:
df.groupby("screen")[["speed","ram"]].mean().reset_index()

   screen      speed        ram
0      14  47.844305   6.803059
1      15  57.810241  10.704819
2      17  58.120462   9.303630

In [105]:
df_g.groups

{14: [0, 1, 3, 4, 5, 6, 7, 8, 11, 12, 13, 14, 15, 16, 19, 20, 21, 22, 24, 25, 26, 27, 28, 29, 30, 31, 34, 36, 37, 38, 39, 40, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 53, 54, 55, 56, 59, 63, 64, 65, 66, 67, 68, 69, 70, 72, 73, 74, 75, 76, 78, 79, 81, 84, 85, 86, 87, 88, 89, 91, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 104, 106, 107, 108, 109, 111, 112, 113, 114, 117, 118, 119, 120, 121, 122, 125, 127, 128, 129, 130, ...], 15: [2, 9, 10, 17, 18, 33, 35, 41, 52, 60, 61, 62, 77, 80, 82, 83, 92, 103, 110, 116, 123, 124, 137, 138, 149, 150, 151, 155, 157, 159, 161, 162, 171, 172, 175, 189, 199, 202, 206, 209, 212, 221, 231, 233, 236, 245, 246, 259, 260, 261, 262, 267, 268, 269, 270, 272, 274, 283, 284, 291, 303, 308, 320, 322, 329, 342, 344, 347, 348, 352, 355, 356, 357, 364, 367, 371, 380, 395, 405, 408, 412, 413, 423, 426, 428, 441, 445, 447, 449, 452, 453, 454, 455, 457, 459, 463, 464, 466, 475, 478, ...], 17: [23, 32, 57, 58, 71, 90, 105, 115, 126, 158, 177, 181, 201, 211, 214, 220, 229, 256, 306, 317, 338, 339, 358, 363, 414, 436, 438, 440, 456, 458, 488, 507, 515, 557, 560, 575, 582, 584, 620, 641, 645, 656, 660, 676, 680, 686, 717, 719, 745, 751, 754, 757, 772, 793, 803, 881, 894, 935, 972, 998, 1003, 1007, 1009, 1011, 1035, 1067, 1135, 1141, 1142, 1144, 1154, 1158, 1161, 1175, 1183, 1201, 1203, 1206, 1229, 1253, 1275, 1308, 1313, 1335, 1339, 1351, 1385, 1387, 1394, 1411, 1440, 1445, 1447, 1477, 1502, 1506, 1509, 1532, 1542, 1565, ...]}

In [111]:
df[(df["speed"]<20) & (df["ram"]<10)]

Empty DataFrame
Columns: [Unnamed: 0, price, speed, hd, ram, screen, cd, multi, premium, ads, trend]
Index: []

In [115]:
1==1 or 2==4

True

In [122]:
df.iloc[1:4,:]

   Unnamed: 0  price  speed   hd  ram  screen  cd multi premium  ads  trend
1           2   1795     33   85    2      14  no    no     yes   94      1
2           3   1595     25  170    4      15  no    no     yes   94      1
3           4   1849     25  170    8      14  no    no      no   94      1

In [136]:
df.ram.mode()

0    8
dtype: int64

In [135]:
df.speed.agg(["mean","max","min"])

mean     52.011024
max     100.000000
min      25.000000
Name: speed, dtype: float64

In [138]:
df.skew()

Unnamed: 0    0.000000
price         0.711725
speed         0.657008
hd            1.378019
ram           1.386202
screen        1.634008
ads          -0.553328
trend         0.236669
dtype: float64

In [140]:
df.sem()

Unnamed: 0    22.840023
price          7.341370
speed          0.267434
hd             3.268056
ram            0.071177
screen         0.011441
ads            0.945919
trend          0.099527
dtype: float64